const NecessareCompetenceData = [
    {
        id: 1,
        name: "Kotlin",
        description: "Необходимый язык для раработки android приложений"
    },
    {
        id: 2,
        name: "Java",
        description: "Mощный и популярный язык программирования, используемый для создания различных приложений."
    },
    {
        id: 3,
        name: "C++",
        description: "Bысокоуровневый язык программирования, используемый для разработки системного и прикладного программного обеспечения."
    },
    {
        id: 4,
        name: "Swift",
        description: "Cовременный язык программирования, разработанный компанией Apple для создания приложений под iOS и macOS."
    },
    {
        id: 5,
        name: "PHP",
        description: "Cкриптовый язык программирования, часто используемый для создания веб-сайтов."
    },
    {
        id: 6,
        name: "R",
        description: "Язык программирования и среда разработки, специализирующиеся на статистическом анализе данных."
    },
    {
        id: 7,
        name: "Go",
        description: "Язык программирования, созданный компанией Google, известен своей производительностью и простотой."
    },
    {
        id: 8,
        name: "TypeScript ",
        description: "Язык программирования, расширяющий возможности JavaScript с помощью статической типизации."
    },
    {
        id: 9,
        name: "Scala",
        description: "Язык программирования, совмещающий преимущества функционального и объектно-ориентированного программирования."
    },
    {
        id: 10,
        name: "Perl",
        description: "Универсальный язык программирования, хорошо подходящий для обработки текстовой информации."
    },
]

export default NecessareCompetenceData